[
  {
    "date": "September 25, 2023",
    "text": [
      "In our practical research, all groups submitted their 3 project proposals.",
      "We greeted and sang 'Happy Birthday' to Ma'am Dianne because it's her day.",
      "I had dinner at Jollibee with my friends."
    ]
  },
  {
    "date": "September 26, 2023",
    "text": [
      "In our physical education class, we learned and did some dance.",
      "I had dinner at Mcdo with my friends because it's raining.",
      "The jeepney we were riding was hit by another jeepney near NCBA."
    ]
  },
  {
    "date": "September 27, 2023",
    "text": [
      "We did a lot of activity in 'Pagbasa at Pagsusuri ng Iba't Ibang Teksto Tungo sa Pananaliksik'.",
      "We don't have an 'EAPP' class because our teacher had a meeting.",
      "Regarding clubs, most of our classmates weren't able to register for their first choice, so they had to reselect their second choice.",
      "I just started working on my journal."
    ]
  },
  {
    "date": "September 28, 2023",
    "text": [
      "I uploaded this journal on GitHub to make it accessible anytime",
      "It was raining heavily but thank goodness it wasn't raining when we were about to go home",
      "I had dinner at Jollibee with my friends."
    ]
  },
  {
    "date": "September 29, 2023",
    "text": [
      "I've been thinking about my homework for tomorrow and haven't done anything all day because I got sick."
    ]
  },
  {
    "date": "September 30, 2023",
    "text": [
      "I woke up early and i'm feeling much better than yesterday.",
      "I finished all my assignments for the day.",
      "I added a search bar and a database to this journal, arranged it in descending order and did some code cleaning."
    ]
  },
  {
    "date": "October 1, 2023",
    "text": [
      "I just did some house work and some assignments that needed for the whole week then the rest are doing my hobbies."
    ]
  },
  {
    "date": "October 2, 2023",
    "text": [
      "Nothing much special about this day we just did some activities and also ma'am Dianne announced the date of our title defense."
    ]
  },
  {
    "date": "October 3, 2023",
    "text": [
      "In our Physical Education, we just practice dancing and sir announced important things after that.",
      "In our Physical Science, we just also did an group activity, sir announced our iLs and we selected our group members."
    ]
  },
  {
    "date": "October 4, 2023",
    "text": [
      "We did some groupings on EAPP and reported our last group works.",
      "Thankfully i passed on our long quiz in Personal Development subject.",
      "For our upcoming title defense tomorrow we have a meeting and we double checked the presentation then add more details into it."
    ]
  },
  {
    "date": "October 5, 2023",
    "text": [
      "I nearly got late for my first subject because there was so much traffic.",
      "Ma'am Chicklet didn't have a lesson today so that we can get ready for our title defense.",
      "Thankfully and sadly, our 2nd title got rejected and we're going to re-defend our 1st title soon.",
      "Our advisor announced that our homeroom schedule is going to be rescheduled because sir has another class at that time."
    ]
  },
  {
    "date": "October 6, 2023",
    "text": [
      "My cousin dropped by our home and used my PC to work on his engineering project.",
      "I have completed all three of my assignments for tomorrow so that i won't have to think about them when I get home."
    ]
  },
  {
    "date": "October 7, 2023",
    "text": [
      "Not much special happened today. We did some activities, discussed a new lesson and also took part in a survey conducted by college students about programming."
    ]
  },
  {
    "date": "October 8, 2023",
    "text": [
      "It's Sunday and it's my rest day, so I just did some assignments and rested.",
      "I added a new feature to this journal which is a modal slider that makes it easier to focus on one slide at a time and allows you to navigate to the next or previous slide.",
      "Our club president announced that we have a meeting tomorrow."
    ]
  },
  {
    "date": "October 9, 2023",
    "text": [
      "I woke up early to get ready for our first face-to-face club meeting, i met our new officers and they are nice.",
      "I arrived too early at the meeting and waited for others to arrive. We discussed upcoming events and plans for the club.",
      "I'm tired for today, so I hopped on a voice call just to clarify something about our dance practice for tomorrow then sleep."
    ]
  },
  {
    "date": "October 10, 2023",
    "text": [
      "I started working on our iLs experiment for physical science and i'll check tomorrow and provide my documents to my group so that my other group members can complete the other part they're assigned to do.",
      "We practiced some dance steps for our iLs in Physical Education and our music for it is 'Butter' by BTS.",
      "Afterward, we went to the library to review for our next subject because there will be a quiz later on. We completed our quiz and hopefully we will get a high or passing score."
    ]
  },
  {
    "date": "October 11, 2023",
    "text": [
      "Nothing much special about this day, we just discussed the new lesson.",
      "In our Personal Development iLs, we assigned roles to each member to have everyone participation.",
      "After class, we had a small practice session for our Physical Education iLs dance."
    ]
  },
  {
    "date": "October 12, 2023",
    "text": [
      "I arrived at school late because of the traffic but Ma'am Chicklet doesn't have a lesson.",
      "We convinced Sir Leyben not to have a quiz today and we just have a lesson but after we finished all the modules, we will have a long quiz and lots of activities.",
      "We don't have Computer Programming today because Ma'am Dianne is not feeling well but she gave us an activity, which is an essay about 'Why do apps and games take time to develop?'",
      "After we completed our essay, we practiced some dance steps."
    ]
  },
  {
    "date": "October 13, 2023",
    "text": [
      "Today is our rest day but for me, it is not. Why? Because as soon as I opened my eLMS, a lot of assignments were added and I spent the entire day working on half of them.",
      "We were supposed to have a meeting for the debate tomorrow this evening but it got canceled."
    ]
  },
  {
    "date": "October 14, 2023",
    "text": [
      "We have a debate today and we are not prepared. Thankfully and sadly, our debate group didn't continue and we will resume it next week.",
      "In our EAPP class, we watched an iWitness video documentary titled 'Walang Maiiwan' by Kara David and after that we will create a reaction paper.",
      "We had a quiz today on Personal Development and I passed thankfully.",
      "We practiced our dance again.",
      "I was left at home because my family went to our province for my uncle's golden birthday."
    ]
  },
  {
    "date": "October 15, 2023",
    "text": [
      "It's so boring at home and I'm the only one here but it's alright since it's so peaceful and I like it.",
      "I just worked on some of my assignments and completed what's needed for tomorrow."
    ]
  },
  {
    "date": "October 16, 2023",
    "text": [
      "We pretty much did nothing because only few of us were present.",
      "Our classmates got in trouble because they ate food inside the classroom."
    ]
  },
  {
    "date": "October 17, 2023",
    "text": [
      "We ate at Jollibee for our lunch.",
      "We performed our dance progress for our Physical Education teacher and he gave us some advice to make it better."
    ]
  },
  {
    "date": "October 18, 2023",
    "text": [
      "We had a debate after our lesson and quiz in our 'Pagbasa at Pagsusuri ng Iba't Ibang Teksto Tungo sa Pananaliksi' subject and it went well.",
      "Ma'am Celeste is absent so we didn't have a session with her but she gave us activity to do.",
      "We began a new module in our personal development.",
      "We had a online meeting today for our title defense for tomorrow.",
      "I go to sleep at 2 am because that's when we finished revising our presentation."
    ]
  },
  {
    "date": "October 19, 2023",
    "text": [
      "We had a consultation in our 'Filipino sa Piling Larang' class.",
      "Sir Leyben and Sir Joaquin assigned consequences for those who violated school guidelines and Sir Joaquin also announced our new homeroom schedule.",
      "Today was our title defense and we are relived that our title was accepted."
    ]
  },
  {
    "date": "October 20, 2023",
    "text": [
      "I had planned to simply rest today but that changed, as I ended up doing some house chores and submitting all 10 assignments throughout the day."
    ]
  },
  {
    "date": "October 21, 2023",
    "text": [
      "We didn't do much today, just a new lesson, new assignments and some activities.",
      "I watched some videos about Unity to gain tips and knowledge because I needed them for our product in our research."
    ]
  },
  {
    "date": "October 22, 2023",
    "text": [
      "I spent half the day on my PC because I was coding a project and I also tried to learn Unity by working on basic concepts."
    ]
  },
  {
    "date": "October 23, 2023",
    "text": [
      "We had a long quiz in our 'Filipino sa Piling Larang' subject, thankfully I reviewed a bit and answered most of the questions. Ma'am Chicklet got upset because some of my classmates were helping others who were still taking the quiz and because of that she collected all the quizzes.",
      "During our Personal Development class, Sir Leyben was observed by the assistant principal. I was called to recite but my mind got blocked at the middle of my recitation.",
      "We still don't have a homeroom session today because we don't have an assigned room yet.",
      "In our Computer Programming class, Ma'am Dianne just discussed the module because we were behind the lesson. During our computer laboratory time, we were supposed to have an activity but since Ma'am Dianne is our club adviser, she allowed us to submit it late but we had a club officer meeting to prepare for the upcoming general assembly this week.",
      "After school, we worked on our iLs business plan for 'Filipino sa Piling Larang' because it's due tomorrow and and I went to sleep at around 2:00am."
    ]
  },
  {
    "date": "October 24, 2023",
    "text": [
      "Today is our dance performance and I woke up early, arrived to school at 8:00 am for practice.",
      "We haven't made much progress and we're still deciding whether to combine two songs or stick with our current one.",
      "In the end, we decided to stick with the current song but repeated the steps for the 2st verse and chorus, simplified the steps.",
      "We finished the song but our dance performance weren't great because we had limited time to prepare.",
      "We submitted our iLs in 'Filipino sa Piling Larang' that we worked on yesterday.",
      "We had a quiz in Physical Science and I'm really grateful it was an open-notes quiz. I got a high score because of that."
    ]
  },
  {
    "date": "October 25, 2023",
    "text": [
      "After breakfast, I worked on my brochure assignment that I will submit today in our first subject. I didn't have time to do it yesterday because I was really tired from what happened.",
      "We were supposed to have a quiz in 'Pagbasa at Pagsusuri ng Iba't Ibang Teksto Tungo sa Pananaliksik' but thankfully, Ms. Stephanie moved it to Saturday.",
      "We didn't have an 'EAPP' class because we attended a school orientation program.",
      "In Personal Development, we just had a discussion about the lesson and Sir Jessie announced that we'll have a quiz on Saturday.",
      "Tomorrow, we have a club general assembly so we worked on our presentation, a guide script and planned the flow of the assembly.",
      "We also worked on our RRL (Related Literature Review) in Practical Research and because of that, I went to sleep at around 2:30 am."
    ]
  },
  {
    "date": "October 26, 2023",
    "text": [
      "I woke up early for our assembly and thankfully i arrived early at the school and setup the equipments needed for the assembly",
      "The assembly went okay, it wasn't great or bad. We just needed more time to discuss our assembly but the one hour per session was not enough. So, we ended up combining the two sessions and rushed through the assembly for the second batch.",
      "After the assembly, I worked on my Practical Research assignment and did a quick review because we had a long quiz scheduled for today. We talked to Sir and asked if he could adjust the quiz since we were really tired.",
      "Thankfully, Sir Leyben canceled the long quiz that was supposed to cover modules 1 to 5 and made it cover only modules 1 to 2. I ended up getting a great score.",
      "We had a full lesson in our computer programming class because we were behind in the lesson but we have a homework activity."
    ]
  },
  {
    "date": "October 27, 2023",
    "text": [
      "I pretty much experimented Unity the whole day because we needed it for our research product which is a multiplayer game, its so hard to learn unity specially when im beginner and the feature we will do is a multiplayer one.",
      "I completed most of my assignments in eLMS to reduce my worries.",
      "I also edited the pictures taken during our general assembly so that we can post them soon.",
      "we finished and submitted our iLs in Physical Science."
    ]
  },
  {
    "date": "October 28, 2023",
    "text": [
      "Today is my birthday and I'm now 17 years old!",
      "My emotions are like a rollercoaster today because it's my birthday and we have a lot of long quizzes.",
      "I answered most of the questions in our long quiz for 'Pagbasa at Pagsusuri ng Iba't Ibang Teksto Tungo sa Pananaliksik', I'm hoping for a passing score.",
      "Thankfully, I got a great score on our long quiz in Personal Development.",
      "After school, we went to SM Taytay to celebrate my birthday and I treated them to dinner at Mang Inasal."
    ]
  },
  {
    "date": "October 29, 2023",
    "text": [
      "I just did some regular house chores and the rest of the day was for relaxation because I was very tired last week."
    ]
  },
  {
    "date": "October 30, 2023",
    "text": [
      "I submitted only one assignment today because I was a bit more tired.",
      "I reset my computer and upgraded it to Windows 11 to improve its appearance and performance while using it.",
      "I'm planning what I'll do for tomorrow so that i can finish all my tasks and focus on reviewing for our upcoming first quarter examination."
    ]
  },
  {
    "date": "October 31, 2023",
    "text": [
      "I've completed and submitted all the work I needed to do.",
      "By tomorrow, I'll concentrate on studying for first quarter examination and doing other non-academic activities."
    ]
  },
  {
    "date": "November 1, 2023",
    "text": [
      "We went to the cemetery today to visit my father and we also visited relatives on my father's side. Afterward, we had dinner at Mang Inasal before heading home."
    ]
  },
  {
    "date": "November 2, 2023",
    "text": [
      "Tomorrow is our first quarter exam and I just created a reviewer for the exam subjects. I reviewed some of it to prepare."
    ]
  },
  {
    "date": "November 3, 2023",
    "text": [
      "Today is our first quarter exam and I'm nervous about what the exam will be like.",
      "Our personal development exam wasn't too easy or too hard and I still managed to answer all the questions.",
      "Computer programming 4 exam was the easiest for me since im good at backend programming.",
      "Computer programming 5 was kind of easy but I didn't review that well so I might just get a passing score.",
      "After I went home, I created a reviewer for tomorrow's examination"
    ]
  },
  {
    "date": "November 4, 2023",
    "text": [
      "Filipino sa Piling Larang exam is not that hard to answer since Ma'am Chicklet tackled the lesson carefully and most of the exam questions are ones we answered in our long quiz before the exam.",
      "The Practical Research exam made my brain go confused, although I think it will be easy to answer if I understand it more carefully. I hope I'll get at least a passing score."
    ]
  },
  {
    "date": "November 5, 2023",
    "text": [
      "Since we have more exams tomorrow, I just created a reviewer for three more subjects.",
      "I only managed to review one subject because I don't know if I got lazy or if my mind just doesn't want to review. Regardless, I want to review to get a high score."
    ]
  },
  {
    "date": "November 6, 2023",
    "text": [
      "I arrived a few minutes late for my first examination subject and I didn't get to the exam earlier. Fortunately, we managed to take the exam because of Sir Seth, who spoke to our proctor to let us take an exam.",
      "This exam day is the most challenging one I've ever experienced in this first quarter exam. Some of the exam questions weren't covered in our sessions and it wasn't made clear what to focus on. I also think its because I didn't learn or review it by myself."
    ]
  },
  {
    "date": "November 7, 2023",
    "text": [
      "We don't have class today because other students are taking examinations on their schedule and it affects our schedule as they are using our room. So, we don't have class for today.",
      "I took this day to relax and rest after the effort I put into taking and preparing for the exams."
    ]
  },
  {
    "date": "November 8, 2023",
    "text": [
      "We only did this day is consultations for those who didn't take the exam in our schedule and also for those who missed activities."
    ]
  },
  {
    "date": "November 9, 2023",
    "text": [
      "We only double checked our test paper in Filipino sa Piling Larang and like yesterday it was just consultations.",
      "Due to a seminar for the ICPeP organization, we didn't attend our Practical Research session but Sir Leyben mentioned that they will focus now making the Chapter 1.",
      "Unfortunately, we didn't manage to finish the seminar session due to room availability issues. There wasn't a specific room to continue the session, so they scheduled the continuation for the next session. They mentioned that the next session will be in a courtroom instead of ordinary rooms.",
      "Donavan brought a Polaroid and he took a picture of me then I took one of him.",
      "In our Computer Programming class, it was just a consultation and we were assigned a task to submit the progress of our game product by Friday. After that, we took two Polaroid pictures with Ma'am Dianne"
    ]
  },
  {
    "date": "November 10, 2023",
    "text": [
      "Since we didn't have a lot of academic tasks to do, I decorated our house for Christmas. I assembled the Christmas tree, put up the Christmas lantern, hung Christmas lights and so on.",
      "After that, I spent all my time coding and learning Unity since I don't have much knowledge about it."
    ]
  },
  {
    "date": "November 11, 2023",
    "text": [
      "Ma'am Galsim returned our test papers and thankfully I managed to pass and even got a high score according to her computation of grades. The passing score is 50 but I think my score is not just at the passing level because I know that 75 is the passing score.",
      "Also, Ma'am Celeste returned our test papers but unfortunately I didn't achieve the passing score. I believe that most of my classmates also didn't reach the passing score.",
      "We didn't have class in Personal Development, it was just a consultation. Some of my classmates took exams since they didn't manage to take the exam in our given schedule.",
      "Since today is November 11 which its online sale, I ordered a guitar string because my 1st string got broken.",
      "Regarding our game product, I successfully imported our two game characters and assigned them their basic movements."
    ]
  },
  {
    "date": "November 12, 2023",
    "text": [
      "Nothing much to do today. I helped clean our home and spent the rest of the day coding for our game product and doing my hobbies like playing games.",
      "Regarding our game product, we managed to give our characters special interaction movements such as rotating the bearing by 90 degrees and picking up objects."
    ]
  },
  {
    "date": "November 13, 2023",
    "text": [
      "We don't have class with Ma'am Chicklet but she announced an activity for us today.",
      "Sir Leyben gave us time to work on our practical research paper and also show us if we have any missed activities.",
      "Sir Joaquin announced that we would have a homeroom session today in room 103.",
      "During our homeroom, Sir announced the submission of this journal, a survey to answer and information for those interested in joining the chess intramurals. He also provided details for anyone curious about their grades in the senior high school assessment. Thankfully, my grade for it is not that bad.",
      "After homeroom, we submitted the activity we did for Ma'am Chicklet. She returned our examinations and business proposals to return them to our classmates.",
      "Ma'am Dianne is absent today but she assigned us an activity to complete. I'll be the one collecting the papers and submitting them to Sir Joaquin.",
      "We have a club collaboration meeting tonight with the Chess Club, where we discussed the details of our event collaboration."
    ]
  },
  {
    "date": "November 14, 2023",
    "text": [
      "We have a new activity with Sir Joy, which involves a dance with a partner. We will be presenting it in our next meeting.",
      "Sir Miro returned our examinations today and we began a new lesson followed by a quiz and activity."
    ]
  },
  {
    "date": "November 15, 2023",
    "text": [
      "My squad members participated in the Mobile Legends Intramurals Tournament but unfortunately we lost.",
      "We started a new lesson for the second quarter.",
      "Donavan and I interviewed two fellow students who are willing to apply for the Club officer position.",
      "We completed Chapter 1 of our practical research and we will submit it tomorrow.",
      "I finalized the character mechanics for the submission of our game progress (DevLog #1) tomorrow.",
      "The phone that I wanted to buy was finally released here in the Philippines and I bought it online."
    ]
  },
  {
    "date": "November 16, 2023",
    "text": [
      "Same as yesterday, we started a new lesson for the second quarter.",
      "We were unable to attend our practical research and the first class of our major subject because the ICPeP Organization invited us to their first general assembly.",
      "We handed the paper we prepared yesterday to our group members to pass to Sir LeyBen, as we couldn't attend the class.",
      "After the assembly, we did the actitvity that Ma'am Dianne gave our class to do and after that we showed our character mechanics and I submitted it after the class on Microsoft OneDrive."
    ]
  },
  {
    "date": "November 17, 2023",
    "text": [
      "Our classmate sent a link to submit our journal but I'm still thinking whether I should recode this journal to make it weekly instead of daily.",
      "I began cleaning up my code and added some additional information about myself to make it look more like a portfolio."
    ]
  },
  {
    "date": "November 18, 2023",
    "text": [
      "As the second quarter started, not much happened today. We had a new lesson and activity.",
      "I sent the portfolio link to Sir Joaquin on Microsoft Teams instead of putting it on Drive because my website is live and hosted by GitHub.",
      "The phone I bought online has finally arrived and I'm thankful that it arrived smoothly."
    ]
  },
  {
    "date": "November 19, 2023",
    "text": [
      "I did nothing much today, just relaxed, did some house chores and played games."
    ]
  },
  {
    "date": "November 20, 2023",
    "text": [
      "We don't have class with Ma'am Chicklet but she announced an activity for us today.",
      "We did our chapter 2 in practical research as well as complete and clarify the things we needed to do since last meeting we didnt have a chance to attend the class",
      "We started a new lesson in our Computer Programming 4 class and completed some activities."
    ]
  },
  {
    "date": "November 21, 2023",
    "text": [
      "Donavan and I arrived on campus early to practice the dance we will present later, as he is my partner.",
      "During our performance i think executed it normally and smoothly.",
      "Sir Joy announced that our iLs will be the cheer dance performance and for the entire quarter, we will focus on practicing our cheer dance during his sessions.",
      "In our Physical Science, we just tackled about the new lesson and did some activity."
    ]
  },
  {
    "date": "November 22, 2023",
    "text": [
      "In our 'Pagbasa at Pagsusuri ng Iba't Ibang Teksto Tungo sa Pananaliksik', we drew a tulip flower using the resources we brought and following the steps that Ma'am presented.",
      "Ma'am Celeste started a new lesson and assigned us an activity to work on, which we will submit in the next meeting.",
      "We just tackled a new lesson in personal development",
      "Finally, someone contacted me and expressed interest in the open position for our club officer."
    ]
  },
  {
    "date": "November 23, 2023",
    "text": [
      "Ma'am Chicklet is absent so we didn't have a session with her but she gave us an activity to do.",
      "We were supposed to submit our chapter 2 today but we forgot. However, Sir LeyBen allowed us to pass it in the next session.",
      "We had a meeting today with Ma'am Dianne and Ma'am Tanaka regarding the upcoming SSG Election.",
      "We discussed a new lesson for Computer Programming 5 and did some laboratory activity.",
      "Sir Joaquin said we will check the eLMS to see if there will be a submission for this portfolio."
    ]
  }
]